Public Member Functions | Public Attributes | Friends | List of all members
API_IFCTranslatorIdentifier Struct Reference
Project Operations
IFC Translator Identifier. More...
#include <APIdefs_Automate.h>
 Public Member Functions
API_IFCTranslatorIdentifier ()
API_IFCTranslatorIdentifier (const API_IFCTranslatorIdentifier &that)
API_IFCTranslatorIdentifier (API_IFCTranslatorIdentifier &&that)
~API_IFCTranslatorIdentifier ()
API_IFCTranslatorIdentifier &  | operator= (API_IFCTranslatorIdentifier other)
void  | Swap (API_IFCTranslatorIdentifier &other)
 Public Attributes
GSHandle  | innerReference
Internal reference.
GS::UniString  | name
IFC Translator name.
 Friends
void  | Swap (API_IFCTranslatorIdentifier &left, API_IFCTranslatorIdentifier &right)
Detailed Description
IFC Translator Identifier.
Since
Archicad 26
Remarks
This structure is used in ACAPI_IFC_GetIFCExportTranslatorsList.
Constructor & Destructor Documentation
◆ API_IFCTranslatorIdentifier() [1/3]
 API_IFCTranslatorIdentifier::API_IFCTranslatorIdentifier  |  ( |   | )
inline
◆ API_IFCTranslatorIdentifier() [2/3]
 API_IFCTranslatorIdentifier::API_IFCTranslatorIdentifier  |  ( |  const API_IFCTranslatorIdentifier &  |  that | )
inline
◆ API_IFCTranslatorIdentifier() [3/3]
 API_IFCTranslatorIdentifier::API_IFCTranslatorIdentifier  |  ( |  API_IFCTranslatorIdentifier &&  |  that | )
inline
◆ ~API_IFCTranslatorIdentifier()
 API_IFCTranslatorIdentifier::~API_IFCTranslatorIdentifier  |  ( |   | )
inline
Member Function Documentation
◆ operator=()
 API_IFCTranslatorIdentifier & API_IFCTranslatorIdentifier::operator=  |  ( |  API_IFCTranslatorIdentifier  |  other | )
inline
◆ Swap()
 void API_IFCTranslatorIdentifier::Swap  |  ( |  API_IFCTranslatorIdentifier &  |  other | )
inline
Friends And Related Symbol Documentation
◆ Swap
 void Swap  |  ( |  API_IFCTranslatorIdentifier &  |  left,
|  API_IFCTranslatorIdentifier &  |  right
)
friend
Member Data Documentation
◆ innerReference
 API_IFCTranslatorIdentifier::innerReference
Internal reference.
◆ name
 API_IFCTranslatorIdentifier::name
IFC Translator name.